IDENTIFICATION DIVISION.
PROGRAM-ID. led_numbers.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LED-TABLE.
	05 LED-DIGITS OCCURS 30 TIMES.
		10 LED-DIGIT PIC X(4).
01 USER-NUMBER 		PIC X(15).
01 COUNTER			PIC 9(2).
01 COUNTER-SPACES	PIC 9(2).
01 NUM-COUNTER		PIC 9(2).
01 LINE-DIGIT 		PIC 9(2).
01 SINGLE-DIGIT		PIC 9.
01 LINE-COUNT   	PIC 9.

PROCEDURE DIVISION.
PROGRAM-BEGIN.
	DISPLAY "Enter a number: ".
	ACCEPT USER-NUMBER.
	INSPECT USER-NUMBER TALLYING COUNTER FOR CHARACTERS.
	INSPECT USER-NUMBER TALLYING COUNTER-SPACES FOR TRAILING SPACES.
	COMPUTE COUNTER = COUNTER - COUNTER-SPACES.
	MOVE ' _  | | |_|      |   |   _   _| |_  _   _|  _|      |_|   |  _  |_   _|  _  |_  |_| _    |   |   _  |_| |_|  _  |_|  _| ' TO LED-TABLE.
	MOVE 1 TO LINE-COUNT.
	PERFORM PRINT-LINE WITH TEST AFTER UNTIL NUM-COUNTER = COUNTER.
	MOVE 0 TO NUM-COUNTER.
	MOVE 2 TO LINE-COUNT.
	DISPLAY " ".
	PERFORM PRINT-LINE WITH TEST AFTER UNTIL NUM-COUNTER = COUNTER.
	MOVE 0 TO NUM-COUNTER.
	MOVE 3 TO LINE-COUNT.
	DISPLAY " ".
	PERFORM PRINT-LINE WITH TEST AFTER UNTIL NUM-COUNTER = COUNTER.		

PROGRAM-DONE.
STOP RUN.

SHOW-LINE.
	DISPLAY LED-DIGITS(LINE-DIGIT) WITH NO ADVANCING.

PRINT-LINE.
	ADD 1 TO NUM-COUNTER.
	MOVE USER-NUMBER(1:NUM-COUNTER) TO SINGLE-DIGIT.
	IF SINGLE-DIGIT NOT = SPACE
		IF SINGLE-DIGIT = 0
			MOVE LINE-COUNT TO LINE-DIGIT
		ELSE
			COMPUTE LINE-DIGIT = SINGLE-DIGIT * 3 + LINE-COUNT
		END-IF
	END-IF.
	PERFORM SHOW-LINE.
